ADNdlc/STM32_CubeIDE/H743/0-8_example_project_v2/BSP/Drivers/platform/stm32/System/MemPool/stm32_h7_malloc.c
#include "stm32_h7_malloc.h"

#ifdef __ARMCC_VERSION
#if !(__ARMCC_VERSION >= 6010050) /* 不是AC6编译器，即使用AC5编译器时 */

/* 内存池(64字节对齐) */
static __align(64) uint8_t mem1base[MEM1_MAX_SIZE]; /* 内部SRAM内存池 */
static __align(64) uint8_t mem2base[MEM2_MAX_SIZE] __attribute__((
    at(0XC01F4000))); /* 外部SDRAM内存池,前面2M给LTDC用了(1280*800*2) */
static __align(64) uint8_t mem3base[MEM3_MAX_SIZE]
    __attribute__((at(0x30000000))); /* 内部SRAM1+SRAM2内存池 */
static __align(64) uint8_t mem4base[MEM4_MAX_SIZE]
    __attribute__((at(0x38000000))); /* 内部SRAM4内存池 */
static __align(64) uint8_t mem5base[MEM5_MAX_SIZE]
    __attribute__((at(0x20000000))); /* 内部DTCM内存池 */
static __align(64) uint8_t mem6base[MEM6_MAX_SIZE]
    __attribute__((at(0x00000000))); /* 内部ITCM内存池  */

/* 内存管理表 */
static MT_TYPE mem1mapbase[MEM1_ALLOC_TABLE_SIZE]; /* 内部SRAM内存池MAP */
static MT_TYPE mem2mapbase[MEM2_ALLOC_TABLE_SIZE]
    __attribute__((at(0XC01F4000 + MEM2_MAX_SIZE))); /* 外部SDRAM内存池MAP */
static MT_TYPE mem3mapbase[MEM3_ALLOC_TABLE_SIZE] __attribute__((
    at(0x30000000 + MEM3_MAX_SIZE))); /* 内部SRAM1+SRAM2内存池MAP */
static MT_TYPE mem4mapbase[MEM4_ALLOC_TABLE_SIZE]
    __attribute__((at(0x38000000 + MEM4_MAX_SIZE))); /* 内部SRAM4内存池MAP */
static MT_TYPE mem5mapbase[MEM5_ALLOC_TABLE_SIZE]
    __attribute__((at(0x20000000 + MEM5_MAX_SIZE))); /* 内部DTCM内存池MAP */
static MT_TYPE mem6mapbase[MEM6_ALLOC_TABLE_SIZE]
    __attribute__((at(0x00000000 + MEM6_MAX_SIZE))); /* 内部ITCM内存池MAP */

#else /* 使用AC6编译器时 */

/* 内存池(64字节对齐) */
static __ALIGNED(64) uint8_t mem1base[MEM1_MAX_SIZE]; /* 内部SRAM内存池 */
static __ALIGNED(64) uint8_t mem2base[MEM2_MAX_SIZE]
    __attribute__((section(".bss.ARM.__at_0XC01F4000"))); /* 外部SDRAM内存池,前面2M给LTDC用了(1280*800*2)
                                                           */
static __ALIGNED(64) uint8_t mem3base[MEM3_MAX_SIZE] __attribute__((
    section(".bss.ARM.__at_0x30000000"))); /* 内部SRAM1+SRAM2内存池 */
static __ALIGNED(64) uint8_t mem4base[MEM4_MAX_SIZE]
    __attribute__((section(".bss.ARM.__at_0x38000000"))); /* 内部SRAM4内存池 */
static __ALIGNED(64) uint8_t mem5base[MEM5_MAX_SIZE]
    __attribute__((section(".bss.ARM.__at_0x20000000"))); /* 内部DTCM内存池 */
static __ALIGNED(64) uint8_t mem6base[MEM6_MAX_SIZE]
    __attribute__((section(".bss.ARM.__at_0x00000000"))); /* 内部ITCM内存池 */

/* 内存管理表 */
static MT_TYPE mem1mapbase[MEM1_ALLOC_TABLE_SIZE]; /* 内部SRAM内存池MAP */
static MT_TYPE mem2mapbase[MEM2_ALLOC_TABLE_SIZE]
    __attribute__((section(".bss.ARM.__at_0XC1E30000"))); /* 内部CCM内存池MAP */
static MT_TYPE mem3mapbase[MEM3_ALLOC_TABLE_SIZE] __attribute__((
    section(".bss.ARM.__at_0X3003C000"))); /* 外部SRAM内存池MAP */
static MT_TYPE mem4mapbase[MEM4_ALLOC_TABLE_SIZE]
    __attribute__((section(".bss.ARM.__at_0X3800F000"))); /* 内部CCM内存池MAP */
static MT_TYPE mem5mapbase[MEM5_ALLOC_TABLE_SIZE] __attribute__((
    section(".bss.ARM.__at_0X2001E000"))); /* 外部SRAM内存池MAP */
static MT_TYPE mem6mapbase[MEM6_ALLOC_TABLE_SIZE]
    __attribute__((section(".bss.ARM.__at_0X0000F000"))); /* 内部CCM内存池MAP */
#endif
#endif

#ifdef __GNUC__
// 这里是GCC编译器(cubeide)的代码
/* 内存池(64字节对齐) */
static uint8_t mem1base[MEM1_MAX_SIZE]
    __attribute__((aligned(64))); // D1域AXI SRAM = 512KB
static uint8_t mem2base[MEM2_MAX_SIZE]
    __attribute__((section(".sdram_pool"), aligned(64))); // 外部SDRAM
static uint8_t mem3base[MEM3_MAX_SIZE] __attribute__((
    section(".sram12_pool"), aligned(64))); // D2域AHB SRAM1,AHB SRAM2 = 256K
static uint8_t mem4base[MEM4_MAX_SIZE]
    __attribute__((section(".sram4_pool"), aligned(64))); // D3域AHB SRAM4 = 64K
static uint8_t mem5base[MEM5_MAX_SIZE]
    __attribute__((section(".dtcm_pool"), aligned(64))); // 数据TCM RAM = 128 K
static uint8_t mem6base[MEM6_MAX_SIZE]
    __attribute__((section(".itcm_pool"), aligned(64))); // 指令TCM RAM = 64 K
/* 内存管理表(每一项的大小) */
static MT_TYPE mem1mapbase[MEM1_ALLOC_TABLE_SIZE]; /* 内部SRAM内存池MAP */
static MT_TYPE mem2mapbase[MEM2_ALLOC_TABLE_SIZE]
    __attribute__((section(".sdram_map"))); /* 外部SDRAM内存池MAP */
static MT_TYPE mem3mapbase[MEM3_ALLOC_TABLE_SIZE]
    __attribute__((section(".sram12_map"))); /* 内部SRAM1+SRAM2内存池MAP */
static MT_TYPE mem4mapbase[MEM4_ALLOC_TABLE_SIZE]
    __attribute__((section(".sram4_map"))); /* 内部SRAM4内存池MAP */
static MT_TYPE mem5mapbase[MEM5_ALLOC_TABLE_SIZE]
    __attribute__((section(".dtcm_map"))); /* 内部DTCM内存池MAP */
static MT_TYPE mem6mapbase[MEM6_ALLOC_TABLE_SIZE]
    __attribute__((section(".itcm_map"))); /* 内部ITCM内存池MAP */
#endif

/* ================================= 内存管理参数(用于查表法获取大小)
 * ================================== */
/* 内存表大小,记录对应内存管理表的大小 */
const uint32_t memtblsize[SRAMBANK] = {
    MEM1_ALLOC_TABLE_SIZE, MEM2_ALLOC_TABLE_SIZE, MEM3_ALLOC_TABLE_SIZE,
    MEM4_ALLOC_TABLE_SIZE, MEM5_ALLOC_TABLE_SIZE, MEM6_ALLOC_TABLE_SIZE};
/* 内存分块大小,记录对应内存块的大小 */
const uint32_t memblksize[SRAMBANK] = {MEM1_BLOCK_SIZE, MEM2_BLOCK_SIZE,
                                       MEM3_BLOCK_SIZE, MEM4_BLOCK_SIZE,
                                       MEM5_BLOCK_SIZE, MEM6_BLOCK_SIZE};
/* 内存池总大小,记录对应内存池的大小 */
const uint32_t memsize[SRAMBANK] = {MEM1_MAX_SIZE, MEM2_MAX_SIZE,
                                    MEM3_MAX_SIZE, MEM4_MAX_SIZE,
                                    MEM5_MAX_SIZE, MEM6_MAX_SIZE};

/* 内存管理控制器 */
struct _m_mallco_dev mallco_dev = {
    my_mem_init,    /* 内存初始化函数 */
    my_mem_perused, /* 内存使用率函数 */
    {mem1base, mem2base, mem3base, mem4base, mem5base,
     mem6base}, /* 内存池(各个内存池数组的首地址,必须按顺序放) */
    {mem1mapbase, mem2mapbase, mem3mapbase, mem4mapbase, mem5mapbase,
     mem6mapbase},     /* 内存管理状态表(各个各个内存表的首地址) */
    {0, 0, 0, 0, 0, 0} /* 状态位,内存管理未就绪 */
};

/**
 * @brief       复制内存
 * @param       *des : 目的地址
 * @param       *src : 源地址
 * @param       n    : 需要复制的内存长度(字节为单位)
 * @retval      无
 */
void my_mem_copy(void *des, void *src, uint32_t n) {
  uint8_t *xdes = des;
  uint8_t *xsrc = src;
  while (n--)
    *xdes++ = *xsrc++;
}

/**
 * @brief       设置内存值
 * @param       *s    : 内存首地址
 * @param       c     : 要设置的值
 * @param       count : 需要设置的内存大小(字节为单位)
 * @retval      无
 */
void my_mem_set(void *s, uint8_t c, uint32_t count) {
  uint8_t *xs = s;
  while (count--)
    *xs++ = c;
}

/**
 * @brief       内存管理初始化(初始化memx对应内存块)
 * @param       memx : 所属内存块
 * @retval      无
 */
void my_mem_init(uint8_t memx) {
  uint8_t mttsize =
      sizeof(MT_TYPE); // 一个表项大小(字节)               /*
                       // 获取memmap数组的类型长度(uint16_t /uint32_t)*/
  // 根据memx获取对应内存管理表地址	设置值	设置范围(大小)
  my_mem_set(mallco_dev.memmap[memx], 0,
             memtblsize[memx] * mttsize); /* 内存状态表数据清零 */
  mallco_dev.memrdy[memx] = 1;            /* 内存管理初始化OK */
}

/**
 * @brief       获取内存使用率
 * @param       memx : 所属内存块
 * @retval      使用率(扩大了10倍,0~1000,代表0.0%~100.0%)
 */
uint16_t my_mem_perused(uint8_t memx) {
  uint32_t used = 0;
  uint32_t i;
  for (i = 0; i < memtblsize[memx]; i++) {
    if (mallco_dev.memmap[memx][i]) {
      used++;
    }
  }
  return (used * 1000) / (memtblsize[memx]);
}

/**
 * @brief       内存分配(内部调用)
 * @param       memx : 所属内存块
 * @param       size : 要分配的内存大小(字节)
 * @retval      内存偏移地址
 *   @arg       0 ~ 0xFFFFFFFE : 有效的内存偏移地址
 *   @arg       0xFFFFFFFF     : 无效的内存偏移地址
 */
uint32_t my_mem_malloc(uint8_t memx, uint32_t size) {
  signed long offset = 0;
  uint32_t nmemb;     /* 需要的内存块数 */
  uint32_t cmemb = 0; /* 连续空内存块数 */
  uint32_t i;

  if (!mallco_dev.memrdy[memx]) {
    mallco_dev.init(memx); /* 未初始化,先执行初始化 */
  }

  if (size == 0) {
    return 0XFFFFFFFF; /* 不需要分配 */
  }
  nmemb = size / memblksize[memx]; /* 获取需要分配的连续内存块数 */

  if (size % memblksize[memx]) {
    nmemb++;
  }

  for (offset = memtblsize[memx] - 1; offset >= 0;
       offset--) /* 搜索整个内存控制区 */
  {
    if (!mallco_dev.memmap[memx][offset]) {
      cmemb++; /* 连续空内存块数增加 */
    } else {
      cmemb = 0; /* 连续内存块清零 */
    }

    if (cmemb == nmemb) /* 找到了连续nmemb个空内存块 */
    {
      for (i = 0; i < nmemb; i++) /* 标注内存块非空  */
      {
        mallco_dev.memmap[memx][offset + i] = nmemb;
      }

      return (offset * memblksize[memx]); /* 返回偏移地址  */
    }
  }

  return 0XFFFFFFFF; /* 未找到符合分配条件的内存块 */
}

/**
 * @brief       释放内存(内部调用)
 * @param       memx   : 所属内存块
 * @param       offset : 内存地址偏移
 * @retval      释放结果
 *   @arg       0, 释放成功;
 *   @arg       1, 释放失败;
 *   @arg       2, 超区域了(失败);
 */
uint8_t my_mem_free(uint8_t memx, uint32_t offset) {
  int i;

  if (!mallco_dev.memrdy[memx]) /* 未初始化,先执行初始化 */
  {
    mallco_dev.init(memx);
    return 1; /* 未初始化 */
  }

  if (offset < memsize[memx]) /* 偏移在内存池内. */
  {
    int index = offset / memblksize[memx];      /* 偏移所在内存块号码 */
    int nmemb = mallco_dev.memmap[memx][index]; /* 内存块数量 */

    for (i = 0; i < nmemb; i++) /* 内存块清零 */
    {
      mallco_dev.memmap[memx][index + i] = 0;
    }

    return 0;
  } else {
    return 2; /* 偏移超区了 */
  }
}

/**
 * @brief       释放内存(外部调用)
 * @param       memx : 所属内存块
 * @param       ptr  : 内存首地址
 * @retval      无
 */
void myfree(uint8_t memx, void *ptr) {
  uint32_t offset;

  if (ptr == NULL) {
    return; /* 地址为0. */
  }

  offset = (uint32_t)ptr - (uint32_t)mallco_dev.membase[memx];
  my_mem_free(memx, offset); /* 释放内存 */
}

/**
 * @brief       分配内存(外部调用)
 * @param       memx : 所属内存块
 * @param       size : 要分配的内存大小(字节)
 * @retval      分配到的内存首地址.
 */
void *mymalloc(uint8_t memx, uint32_t size) {
  uint32_t offset;
  offset = my_mem_malloc(memx, size);

  if (offset == 0xFFFFFFFF) /* 申请出错 */
  {
    return NULL; /* 返回空(0) */
  } else         /* 申请没问题, 返回首地址 */
  {
    return (void *)((uint32_t)mallco_dev.membase[memx] + offset);
  }
}

/**
 * @brief       重新分配内存(外部调用)
 * @param       memx : 所属内存块
 * @param       *ptr : 旧内存首地址
 * @param       size : 要分配的内存大小(字节)
 * @retval      新分配到的内存首地址.
 */
void *myrealloc(uint8_t memx, void *ptr, uint32_t size) {
  uint32_t offset;
  offset = my_mem_malloc(memx, size);

  if (offset == 0xFFFFFFFF) /* 申请出错 */
  {
    return NULL; /* 返回空(0) */
  } else         /* 申请没问题, 返回首地址 */
  {
    my_mem_copy((void *)((uint32_t)mallco_dev.membase[memx] + offset), ptr,
                size); /* 拷贝旧内存内容到新内存 */
    myfree(memx, ptr); /* 释放旧内存 */
    return (void *)((uint32_t)mallco_dev.membase[memx] +
                    offset); /* 返回新内存首地址 */
  }
}
